dcl-s subtrahend01 packed(2:0) inz;
dcl-s subtrahend02 packed(2:0) inz;
dcl-s diff packed(2:0) inz;

diff = subtrahend01 - subtrahend02;

*inLr = *on;
