dcl-s minuend packed(2:0) inz;
dcl-s substrahend packed(2:0) inz;
dcl-s difference packed(2:0) inz;

difference = minuend - substrahend;

*inLr = *on;
